Repository: vivy-company/aizen
Catalog: aizen/Localizable.xcstrings
Source language: en
Languages: zh_hans

# workspace.create.name
source: Workspace Name
zh_hans: 工作区名称

# workspace.create.namePlaceholder
source: e.g., Work, Personal, Open Source
zh_hans: 例如，工作、个人、开源

# workspace.create.title
source: Create Workspace
zh_hans: 创建工作区

# workspace.edit
source: Edit
zh_hans: 编辑

# workspace.edit.color
source: Color
zh_hans: 颜色

# workspace.edit.save
source: Save
zh_hans: 保存

# workspace.edit.title
source: Edit Workspace
zh_hans: 编辑工作区

# workspace.new
source: New Workspace
zh_hans: 新建工作区

# workspace.repositories.title
source: Repositories
zh_hans: 仓库

# workspace.repository.alsoDelete
source: Also delete repository from filesystem
zh_hans: 同时从文件系统中删除仓库

# workspace.repository.copyPath
source: Copy Path
zh_hans: 复制路径

# workspace.repository.openEditor
source: Open in Editor
zh_hans: 在编辑器中打开

# workspace.repository.openFinder
source: Open in Finder
zh_hans: 在访达中打开

# workspace.repository.openTerminal
source: Open in Terminal
zh_hans: 在终端中打开

# workspace.repository.remove
source: Remove Repository
zh_hans: 移除仓库

# workspace.repository.removeButton
source: Remove
zh_hans: 移除

# workspace.repository.removeMessage
source: This will unlink the repository from Aizen. The repository files will remain on disk unless you check the option below.
zh_hans: 这将从 Aizen 中取消链接仓库。除非您勾选下方选项，否则仓库文件将保留在磁盘上。

# workspace.repository.removeTitle
source: Remove Repository?
zh_hans: 移除仓库？

# workspace.repository.unknown
source: Unknown
zh_hans: 未知

# workspace.search.placeholder
source: Search repositories
zh_hans: 搜索仓库

# workspace.sidebar.title
source: Workspaces
zh_hans: 工作区

# workspace.switchTo
source: Switch to
zh_hans: 切换到

# workspace.switcher.title
source: Switch Workspace
zh_hans: 切换工作区

# workspace.untitled
source: Untitled
zh_hans: 未命名

# workspace.worktree.main
source: MAIN
zh_hans: 主分支

# workspace.worktree.unknown
source: Unknown
zh_hans: 未知

# worktree.branch.browseOrCreate
source: Browse or Create Branch...
zh_hans: 浏览或创建分支...

# worktree.branch.remote
source: (remote)
zh_hans: （远程）

# worktree.branch.switch
source: Switch Branch
zh_hans: 切换分支

# worktree.branch.switchError
source: Branch Switch Error
zh_hans: 分支切换错误

# worktree.create.baseBranch
source: Base Branch
zh_hans: 基础分支

# worktree.create.baseBranchHelp
source: New branch will be created from this branch
zh_hans: 新分支将从此分支创建

# worktree.create.branchExists
source: Branch '%@' already exists
zh_hans: 分支 '%@' 已存在

# worktree.create.branchExists %@
source: Branch '%@' already exists
zh_hans: 分支 '%@' 已存在

# worktree.create.branchExistsChooseDifferent
source: Branch '%@' already exists. Choose a different name.
zh_hans: 分支 '%@' 已存在。请选择其他名称。

# worktree.create.branchName
source: Branch Name
zh_hans: 分支名称

# worktree.create.branchNamePlaceholder
source: e.g., feature-login, bugfix-auth
zh_hans: 例如，feature-login、bugfix-auth

# worktree.create.cancel
source: Cancel
zh_hans: 取消

# worktree.create.create
source: Create
zh_hans: 创建

# worktree.create.failed
source: Worktree Creation Failed
zh_hans: 工作树创建失败

# worktree.create.failedLoadBranches
source: Failed to load branches: %@
zh_hans: 加载分支失败：%@

# worktree.create.generateRandom
source: Generate random name
zh_hans: 生成随机名称

# worktree.create.invalidRepoPath
source: Invalid repository path
zh_hans: 无效的仓库路径

# worktree.create.selectBaseBranch
source: Please select a base branch
zh_hans: 请选择基础分支

# worktree.create.title
source: Create Worktree
zh_hans: 创建工作树

# worktree.detail.actions
source: Actions
zh_hans: 操作

# worktree.detail.ahead
source: %lld ahead
zh_hans: 领先 %lld

# worktree.detail.ahead %lld
source: %lld ahead
zh_hans: 领先 %lld

# worktree.detail.behind
source: %lld behind
zh_hans: 落后 %lld

# worktree.detail.behind %lld
source: %lld behind
zh_hans: 落后 %lld

# worktree.detail.branch
source: Branch
zh_hans: 分支

# worktree.detail.copyBranchName
source: Copy Branch Name
zh_hans: 复制分支名称

# worktree.detail.copyPath
source: Copy Path
zh_hans: 复制路径

# worktree.detail.delete
source: Delete Worktree
zh_hans: 删除工作树

# worktree.detail.deleteConfirmMessage
source: Are you sure you want to delete this worktree? This action cannot be undone.
zh_hans: 确定要删除此工作树吗？此操作无法撤销。

# worktree.detail.deleteConfirmMessageWithName
source: Are you sure you want to delete the worktree '%@'? This action cannot be undone.
zh_hans: 确定要删除工作树 '%@' 吗？此操作无法撤销。

# worktree.detail.deleteConfirmMessageWithName %@
source: Are you sure you want to delete '%@'? This action cannot be undone.
zh_hans: 确定要删除 '%@' 吗？此操作无法撤销。

# worktree.detail.deleteConfirmTitle
source: Delete Worktree
zh_hans: 删除工作树

# worktree.detail.information
source: Information
zh_hans: 信息

# worktree.detail.lastAccessed
source: Last Accessed
zh_hans: 上次访问

# worktree.detail.loadingStatus
source: Loading status...
zh_hans: 正在加载状态...

# worktree.detail.main
source: MAIN
zh_hans: 主分支

# worktree.detail.openEditor
source: Open in Editor
zh_hans: 在编辑器中打开

# worktree.detail.openFinder
source: Open in Finder
zh_hans: 在访达中打开

# worktree.detail.openTerminal
source: Open in Terminal
zh_hans: 在终端中打开

# worktree.detail.path
source: Path
zh_hans: 路径

# worktree.detail.primary
source: PRIMARY WORKTREE
zh_hans: 主工作树

# worktree.detail.refresh
source: Refresh
zh_hans: 刷新

# worktree.detail.showDetails
source: Show Details
zh_hans: 显示详情

# worktree.detail.unsavedChangesMessage
source: The worktree '%@' contains modified or untracked files. Delete anyway?
zh_hans: 工作树 '%@' 包含已修改或未跟踪的文件。是否仍要删除？

# worktree.detail.unsavedChangesMessage %@
source: You have unsaved changes in '%@'. Deleting this worktree will lose these changes.
zh_hans: 您在 '%@' 中有未保存的更改。删除此工作树将丢失这些更改。

# worktree.detail.unsavedChangesTitle
source: Unsaved Changes
zh_hans: 未保存的更改

# worktree.detail.upToDate
source: Up to date
zh_hans: 最新

# worktree.editNote
source: Edit Note
zh_hans: 编辑备注

# worktree.list.add
source: Add Worktree
zh_hans: 添加工作树

# worktree.list.empty.filtered
source: No worktrees match your filters
zh_hans: 没有工作树匹配您的筛选

# worktree.list.empty.noWorktrees
source: No worktrees yet
zh_hans: 暂无工作树

# worktree.list.empty.search
source: No worktrees match your search
zh_hans: 没有工作树匹配您的搜索

# worktree.list.error
source: Error
zh_hans: 错误

# worktree.list.lastAccessed
source: Last accessed: %@
zh_hans: 上次访问：%@

# worktree.list.lastAccessed %@
source: Last accessed %@
zh_hans: 上次访问 %@

# worktree.list.ok
source: OK
zh_hans: 好的

# worktree.list.search
source: Search worktrees
zh_hans: 搜索工作树

# worktree.list.title
source: Worktree Details
zh_hans: 工作树详情

# worktree.list.unknown
source: Unknown
zh_hans: 未知

# worktree.merge.conflict
source: Merge Conflict
zh_hans: 合并冲突

# worktree.merge.conflictMessage
source: Merge conflicts detected in the following files:
zh_hans: 在以下文件中检测到合并冲突：

# worktree.merge.error
source: Merge Error
zh_hans: 合并错误

# worktree.merge.pullFrom
source: Pull from
zh_hans: 拉取自

# worktree.merge.resolveHint
source: Resolve conflicts manually and commit the changes.
zh_hans: 手动解决冲突并提交更改。

# worktree.merge.successful
source: Merge Successful
zh_hans: 合并成功

# worktree.note.title %@
source: Note for %@
zh_hans: %@ 的备注

# worktree.openIn.editors
source: Editors
zh_hans: 编辑器

# worktree.openIn.terminals
source: Terminals
zh_hans: 终端

# worktree.openIn.title
source: Open in...
zh_hans: 打开方式...

# worktree.session.browser
source: Browser
zh_hans: 浏览器

# worktree.session.chat
source: Chat
zh_hans: 对话

# worktree.session.files
source: Files
zh_hans: 文件

# worktree.session.newChat
source: New chat session
zh_hans: 新建对话会话

# worktree.session.newTerminal
source: New terminal session
zh_hans: 新建终端会话

# worktree.session.tab
source: Tab
zh_hans: 标签页

# worktree.session.terminal
source: Terminal
zh_hans: 终端

# worktree.session.terminalTitle
source: Terminal %lld
zh_hans: 终端 %lld

# worktree.session.terminalTitle %lld
source: Terminal %lld
zh_hans: 终端 %lld

# worktree.session.worktree
source: Worktree
zh_hans: 工作树

# worktree.setStatus
source: Set Status
zh_hans: 设置状态

# … truncated, showing first %lld of %lld lines
source: … truncated, showing first %1$lld of %2$lld lines
zh_hans: … 已截断，显示 %2$lld 行中的前 %1$lld 行
